#define _CRT_SECURE_NO_WARNINGS 
#include <stdio.h>
#include <string.h>

// 常量：描述那些不变的量
// 1.字面常量
// 2.const 修饰的常变量
// 3.#define 定义的标识符常量
// 4.枚举常量

//int main()
//{
//	30;
//	3.14;
//	'w';
//	"abc";
//	int a = 10;
//	a = 20;
//	const int b = 30;
//	// 在C语言中，const修饰的是a，本质是变量，但是不能直接修改，有常量的属性
//	//b = 40; // 表达式必须是可修改的左值
//	// 证明b是一个常量
//	//int arr[b];// 表达式必须含有常量值
//	// 创建数组的时候[]里，需要一个常量，放b的时候报错，说明b还是一个变量,称为常变量。
//	// 理解：变量是一块空间，常量是实际的值，变量用来容纳常量，const，只是锁定了值，并不是把空间变成数值。
//	return 0;
//}


//#define MAX 100
//#define STR "abcdef"
//// 没有类型
//
//int main()
//{
//	printf("%d\n", MAX);
//	int a = MAX;
//	printf("%d\n", MAX);
//	printf("%s\n", STR);
//	return 0;
//}



// 生活中的一些值，是可以一一列出来的，如三原色，血型等等；
//enum Color
//{
//	// 枚举常量
//	RED,
//	GREEN,
//	BLUE,
//};
// 枚举常量 默认是从 0 开始的
// 定义枚举常量，只是一个类型，不会向内存开辟空间。
//int main()
//{
//	int num = 10;
//	enum Color c = RED;
//	RED = 20; // err
//	return 0;
//}

// ----------------------------------------------------------------------------------------------------------------

// 字符串：

//int main()
//{
//	// qWef&$
//	// char 字符类型
//	// 'a'
//	// char ch = 'W';
//	// 字符串
//	"abcdefg"; // 字符串字面值
//	// C语言中没有字符串类型。
//
//	char arr1[] = "abcdef";
//	// 字符串的结束标志是 '\0' 的转义字符
//	char arr2[] = { 'a', 'b', 'c', 'd', 'e', 'f' };
//	char arr3[] = { 'a', 'b', 'c', 'd', 'e', 'f', '\0'};
//
//	// arr1 在内存中是 ： a b c d e f \0
//	// arr2 在内存中是 ： a b c d e f 
//
//	int len = strlen("len");
//	// strlen()函数 string length，一个求字符串长度的函数,'\0'之前出现了多少个字符 
//
//	printf("%s\n", arr1);
//	printf("%s\n", arr2);
//	printf("%s\n", arr3);
//	printf("%d\n", len);
//	printf("%d\n", strlen(arr1));
//	printf("%d\n", strlen(arr2));
//	printf("%d\n", strlen(arr3));
//	return 0;
//}


// ----------------------------------------------------------------------------------------------------------------

// 转义字符：

//int main()
//{
//	printf("abcn");
//	printf("abc\n");
//	return 0;
//}

//int main()
//{
//	printf("abd0cef\n");
//	printf("abd\0cef\n");
//	return 0;
//}

// 转义字符，就是转变了原来意思的字符

// 三字母词
// ??( --> [
// ??) --> ]
//
// %d  整形
// %zu sizeof()运算符 的返回值
// %c  字符
// %s  字符串
// %f  float类型
// %lf  double 类型

//int main()
//{
//	//printf("%s\n","(Are you OK \?\?)");
//	// (are you ok]   在一些古老的编译器中 会把 ??( 解析成 [
//	// \? 防止被解析成 三字母词
//
//	//printf("%c\n", '\'');
//	//printf("abcdef\n");
//	//printf("%s\n", "abcdef");
//	//printf("%s\n", "\"");
//
//	// \\, 让\不是转义字符中的\
//
//	//printf("abce\\0dsanjda\n");
//
//	// \a 蜂鸣器
//	// \b 退格符
//	// \t 水平制表符  一个水平制表符是8个字符的位置
//	// \v 垂直制表符
//	// \r 回车
//	// \ddd  ddd表示三个八进制的数字
//	// \xdd  dd表示两个十六进制的数字
//	printf("abc\tbbb\n");
//	printf("abcccc\tbbb\n");
//	//printf("123\r");
//	printf("%c\n", '\130');   // 八进制的130，对应的十进制的 ASCII码值 所对应的字符
//	printf("%c\n", '\x63');
//	printf("%c\n", '\x063'); // 也是可以的，范围是0~127
//
//	//printf("123\r45");
//	return 0;
//}


//int main()
//{
//	printf("%d\n", strlen("c:\test\638\test.c")); // 14
//	return 0;
//}

// ----------------------------------------------------------------------------------------------------------------

// 注释  注解解释，解释代码
/*
注释内容
*/
// C++的注释风格

// C语言的注释，不可以出现嵌套情况，/* /* */ */ 第一个和第三个配成一对，第四个没有配对的左半部分

// 1.注释可以梳理思路
// 2.注释可以对复杂的代码进行解释
// 3.写代码的时候写注释是帮助自己，也是帮助别人
//int main()
//{
//	int* p = NULL; // 创建指针变量p，并赋值为NULL
//	return 0;
//}


// ----------------------------------------------------------------------------------------------------------------

// 选择语句 和 循环语句

//int main()
//{
//	int num = 0;
//	
//	printf("要好好学习吗？\n");
//	scanf("%d", &num);
//	if (num == 1)
//	{
//		printf("好offer\n");
//	}
//	else
//	{
//		printf("卖红薯\n");
//	}
//	return 0;
//}

//int main()
//{
//	int lines = 0;
//
//	while (lines < 20000)
//	{
//		printf("好好学习\n");
//		lines++;
//	}
//	if (lines >= 20000)
//	{
//		printf("好offer\n");
//	}
//	return 0;
//}
// C语言是【结构化】的程序设计语言
// 顺序结构
// 选择结构
// 循环结构
// 生活中的所有事情都可以抽象成这三种顺序中的一种或者几种的组合

// ----------------------------------------------------------------------------------------------------------------

// 函数
// f(x) = 2 * x + 1

// 返回类型 函数名(函数的参数)
//int ADD(int a, int b)
//{
//	return (a + b);
//}
// 函数的返回值

//int main()
//{
//	int num1 = 0;
//	int num2 = 0;
//	scanf("%d %d", &num1, &num2);
//
//	int sum = num1 + num2;
//	printf("%d\n", sum);
//	printf("%d\n", ADD(3, 7));
//
//	return 0;
//}

// 可以把函数想象成一个工厂，原材料（函数参数）给工厂（函数），工厂（函数）处理成产品（返回值）

// 函数的作用： 模块化管理，减少程序重复代码

// ----------------------------------------------------------------------------------------------------------------

// 数组

int main() 
{
	// 存放一组相同类型的元素
	int arr[10] = { 1, 2, 3, 4, 5, 6, 7, 8, 9, 10};
	//    下标      0  1  2  3  4  5  6  7  8  9
	// 下标从零开始
	// [] 内不确切写数量的时候，编译器根据后面的初始化的来自动判断。
	int i = 0;
	while (i < 10) 
	{
		printf("%d\n", arr[i]);
		i++;
	}

	// 建议循环因子 i 是左闭右开的范围，有含义，i < 10, 循环 10 次
	return 0;
}

